Revit 2024 API
HardwoodFinishType Enumeration
 The enumerated type representing the permitted values for the asset property "HardwoodFinish" from the "Hardwood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum HardwoodFinishType
Visual Basic
Public Enumeration HardwoodFinishType
Visual C++
public enum class HardwoodFinishType
Members
Member name | Description
Gloss
Semigloss
Satin
Unfinished
See Also
Autodesk.Revit.DB.Visual Namespace